# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of join statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, you'll use the same Customer Relationship Management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
#Your code here
import sqlite3 as sq3
import pandas as pd

In [2]:
conn = sq3.connect('data.sqlite')
c = conn.cursor()

## Display the names of all the employees in Boston.
Hint: join the employees and offices tables.

In [8]:
#Your code here
c.execute('''SELECT firstName, lastName
             FROM employees 
             JOIN offices 
             USING(officeCode)
             WHERE city = "Boston"''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Do any offices have no employees?
Hint: Combine the employees and offices tables and use a group by.

In [14]:
#Your code here
c.execute('''SELECT city, COUNT(employeeNumber) as employeeCount
             FROM employees
             JOIN offices
             USING(officeCode)
             GROUP BY officeCode
             ''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

            city  employeeCount
0  San Francisco              6
1         Boston              2
2            NYC              2
3          Paris              5
4          Tokyo              2
5         Sydney              4
6         London              2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of each product each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [24]:
#Your code here
c.execute('''SELECT employeeNumber, SUM(quantityOrdered) as TotalProductsSold
             FROM employees e
             JOIN customers c 
             ON e.EmployeeNumber = c.salesRepEmployeeNumber
             JOIN orders o 
             USING(customerNumber)
             JOIN orderdetails od
             USING(orderNumber)
             GROUP BY employeeNumber''')
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

   employeeNumber  TotalProductsSold
0            1165              11854
1            1166               4056
2            1188               4227
3            1216               5561
4            1286               5016
5            1323               7423
6            1337               6186
7            1370              14231
8            1401               9290
9            1501               8205
10           1504               7486
11           1611               6246
12           1612               6632
13           1621               4923
14           1702               4180

## Summary

Congrats! You now know how to use join statements, along with leveraging your foreign keys knowledge!